In [18]:
df=data.frame(emp_id=c(3,1,2),emp_name=c('a','b','c'),emp_date=as.Date(c('2011-1-11','2011-2-22','2013-3-22')),gen=factor(c('f','f','m')))
df

  emp_id emp_name emp_date   gen
1 3      a        2011-01-11 f
2 1      b        2011-02-22 f
3 2      c        2013-03-22 m

In [19]:
#sorting
df[with(df,order(c(emp_id))),]#as df[row,col] is syntax

  emp_id emp_name emp_date   gen
2 1      b        2011-02-22 f
3 2      c        2013-03-22 m
1 3      a        2011-01-11 f

In [20]:
df

  emp_id emp_name emp_date   gen
1 3      a        2011-01-11 f
2 1      b        2011-02-22 f
3 2      c        2013-03-22 m

## Adding new column

In [21]:
df['dept']=c('cse','maths','physics')

In [22]:
df

  emp_id emp_name emp_date   gen dept
1 3      a        2011-01-11 f   cse
2 1      b        2011-02-22 f   maths
3 2      c        2013-03-22 m   physics

## Adding new row

In [23]:
df1=data.frame(emp_id=c(3,1,2),emp_name=c('a','b','c'),emp_date=as.Date(c('2011-1-11','2011-2-22','2013-3-22')),gen=factor(c('f','f','m')),dept=c('cse','maths','physics'))
df1

  emp_id emp_name emp_date   gen dept
1 3      a        2011-01-11 f   cse
2 1      b        2011-02-22 f   maths
3 2      c        2013-03-22 m   physics

In [24]:
rbind(df,df1)#inplace is not true

  emp_id emp_name emp_date   gen dept
1 3      a        2011-01-11 f   cse
2 1      b        2011-02-22 f   maths
3 2      c        2013-03-22 m   physics
4 3      a        2011-01-11 f   cse
5 1      b        2011-02-22 f   maths
6 2      c        2013-03-22 m   physics

In [25]:
df

  emp_id emp_name emp_date   gen dept
1 3      a        2011-01-11 f   cse
2 1      b        2011-02-22 f   maths
3 2      c        2013-03-22 m   physics

In [31]:
#removing column
df1=subset(df,select=c(dept))# selecting a column
df2=subset(df,select=-c(dept))# removing a column

In [32]:
df1
df2

  dept
1 cse
2 maths
3 physics

  emp_id emp_name emp_date   gen
1 3      a        2011-01-11 f
2 1      b        2011-02-22 f
3 2      c        2013-03-22 m

In [38]:
#removing a row
df3=df[-c(2),]
df3

  emp_id emp_name emp_date   gen dept
1 3      a        2011-01-11 f   cse
3 2      c        2013-03-22 m   physics

In [56]:
df1=data.frame(s_id=c(1,2,3,4,5),product=c('a','b','c,','d','e'))
df2=data.frame(s_id=c(2,4,6,8,10),state=c('a','b','c,','d','e'))
df1
df2

  s_id product
1 1    a
2 2    b
3 3    c,
4 4    d
5 5    e

  s_id state
1  2   a
2  4   b
3  6   c,
4  8   d
5 10   e

## Joins

In [54]:
full_outer_join=merge(x=df1,y=df2,by='s_id',all=TRUE)
natural_join=merge(x=df1,y=df2,by='s_id')#or intersection
left_outer_join=merge(x=df1,y=df2,by='s_id',all.x=TRUE)
right_outer_join=merge(x=df1,y=df2,by='s_id',all.y=TRUE)

In [55]:
full_outer_join
natural_join
left_outer_join
right_outer_join

  s_id product state
1  1   a       NA
2  2   b       a
3  3   c,      NA
4  4   d       b
5  5   e       NA
6  6   NA      c,
7  8   NA      d
8 10   NA      e

  s_id product state
1 2    b       a
2 4    d       b

  s_id product state
1 1    a       NA
2 2    b       a
3 3    c,      NA
4 4    d       b
5 5    e       NA

  s_id product state
1  2   b       a
2  4   d       b
3  6   NA      c,
4  8   NA      d
5 10   NA      e

## Conditions and Loops

In [72]:
a=as.integer(readline('Enter a number: '))
if (a%%2==0 & a!=0)#%% for remainder/modulus operator and not just one %
{
    print('Even')
#}
#else{ ---> this won't work
}else
    {
    print('Odd')
    }

Enter a number: 0
[1] "Odd"

In [2]:
l=list(1,2,3,4,5)
for(x in l){ #da loop
#for (x in seq(5)){ #seq is like range in python
    if(x==2){
        next #da loop statement #next(R)==continue(python)
    }
    else if(x==4){
        break
    }
    print(x) 
}

[1] 1
[1] 3

## Armstrong Number

In [83]:
a=153
print(1^3+5^3+3^3)#cube each digit

[1] 153

In [96]:
num=as.integer(readline('Enter a number: '))
temp=num
sum=0
while (temp>0)
    {
    dg=temp%%10
    temp=floor(temp/10)# for c//10 
    sum=sum+dg^3
}
if(sum==num){
    paste('Yes, it is an armstrong number')
}else{
    paste('No, it is not an armstrong number')
}

Enter a number: 153

[1] "Yes, it is an armstrong number"

In [98]:
# Sum of digits
num=as.integer(readline('Enter a number: '))
temp=num
sum=0
while (temp>0){
    dg=temp%%10
    sum=sum+dg
    temp=floor(temp/10)
}
paste('The sum of the digits of',num, 'is',sum)

Enter a number: 153

[1] "The sum of the digits of 153 is 9"

In [104]:
#Reverse of a number
num=as.integer(readline('Enter a number: '))
temp=num
rev=0
while (temp>0){
    dg=temp%%10
    rev=rev*10+dg
    temp=floor(temp/10)
}
paste('The reverse of',num, 'is',rev)

Enter a number: 1230

[1] "The reverse of 1230 is 321"

In [108]:
#Palindrome of a number
num=as.integer(readline('Enter a number: '))
temp=num
rev=0
while (temp>0){
    dg=temp%%10
    rev=rev*10+dg
    temp=floor(temp/10)
}
if(rev==num){
    paste('Yes',num,'is a palindrome')
}else{
    paste('No',num,'is not a palindrome')
}

Enter a number: 1234321

[1] "Yes 1234321 is a palindrome"

In [14]:
lst=c()
even=c()
odd=c()
n=as.integer(readline("Enter no of elements:"))
for (i in seq(n)){
  lst[i]=as.numeric(readline("Enter element no"))
#     if(lst[i] %% 2!=0){
#     odd=append(odd,lst[i])
#       }else{
#         even=append(even,lst[i])
#       }
    }
paste(lst)
for (i in seq(n)){
  if(lst[i] %% 2!=0){
    odd=append(odd,lst[i])
  }else{
    even=append(even,lst[i])
  }
}
print(even)
print(odd)

Enter no of elements:3
Enter element no1
Enter element no2
Enter element no3

[1] "1" "2" "3"

[1] 2
[1] 1 3

In [55]:
lst=c()
even=list()
odd=list()
n=as.integer(readline("Enter no of elements:"))
for (i in seq(n)){
  lst[i]=as.numeric(readline("Enter element no"))
    }
paste(lst)
for (i in seq(n)){
  if(lst[i] %% 2!=0){
    odd=append(odd,lst[i])
  }else{
    even=append(even,lst[i])
  }}
paste("odd",odd)
paste("even",even)

Enter no of elements:3
Enter element no1
Enter element no2
Enter element no3

[1] "1" "2" "3"

[1] "odd 1" "odd 3"

[1] "even 2"

In [ ]:
a=function(a,b,c=1,d=2){
    paste("a:",a,"b:",b,"c:",c,"d:",d)
}
a(1,2,3,4)
a(1,2,3)
a(1,2)
a(1)